app/Controllers/DaftarPasien.php

    public function index()
    {
        $pasienModel = new PasienModel();
        $data['pasien'] = $pasienModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `pasien`
ORDER BY `created_at` DESC