app/Controllers/JadwalKonsultasi.php

SELECT *
FROM `jadwal_konsultasi`
ORDER BY `tanggal_konsultasi` DESC
---
    public function index()
    {
        $model = new JadwalKonsultasiModel();
        $data['jadwal'] = $model->orderBy('tanggal_konsultasi', 'DESC')->findAll();