app/Controllers/JadwalKonsultasi.php

    public function index()
    {
        $model = new JadwalKonsultasiModel();
        $data['jadwal'] = $model->orderBy('tanggal_konsultasi', 'DESC')->findAll();
---
SELECT *
FROM `jadwal_konsultasi`
ORDER BY `tanggal_konsultasi` DESC

    public function simpan()
    {
        $model = new JadwalKonsultasiModel();
        $data = [
            'nama_pasien' => $this->request->getPost('nama_pasien'),
            'tanggal_konsultasi' => $this->request->getPost('tanggal_konsultasi'),
            'jam_konsultasi' => $this->request->getPost('jam_konsultasi'),
            'dokter' => $this->request->getPost('dokter'),
            'keluhan' => $this->request->getPost('keluhan'),
        ];
        $model->insert($data);
---
INSERT INTO `jadwal_konsultasi` (`nama_pasien`, `tanggal_konsultasi`, `jam_konsultasi`, `dokter`, `keluhan`, `created_at`, `updated_at`) VALUES ('Bang Winda ', '2025-08-08', '17:00', 'Dr. Sarah', 'Sakit jantung', '2025-07-22 04:56:39', '2025-07-22 04:56:39')