app/Controllers/Registrasi.php

    public function profil($id)
    {
        $pasienModel = new PasienModel();
        $pasien = $pasienModel->find($id);
---
SELECT *
FROM `pasien`
WHERE `pasien`.`id` = '10'