app/Controllers/RekamMedis.php

SELECT *
FROM `rekam_medis`
WHERE `nama_pasien` LIKE '%hilal%' ESCAPE '!'
ORDER BY `tanggal` DESC
SELECT *
FROM `rekam_medis`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $model = new RekamMedisModel();
        $cari = $this->request->getGet('cari');
        if ($cari) {
            $data['rekam'] = $model
                ->like('nama_pasien', $cari)
                ->orderBy('tanggal', 'DESC')
                ->findAll();
        } else {
            $data['rekam'] = $model->orderBy('tanggal', 'DESC')->findAll();

INSERT INTO `rekam_medis` (`nama_pasien`, `tanggal`, `keluhan`, `diagnosa`, `tindakan`, `dokter`, `created_at`, `updated_at`) VALUES ('Hilal Selamat', '2025-07-03', 'Sakit Kepala, Sesak Nafas, dan Pusing 7 keliling', 'Vertigo', 'Tidur dengan teratur', 'Dr. Ilham Diaz', '2025-06-24 03:40:24', '2025-06-24 03:40:24')
---
    public function simpan()
    {
        $model = new RekamMedisModel();
        $data = [
            'nama_pasien' => $this->request->getPost('nama_pasien'),
            'tanggal' => $this->request->getPost('tanggal'),
            'keluhan' => $this->request->getPost('keluhan'),
            'diagnosa' => $this->request->getPost('diagnosa'),
            'tindakan' => $this->request->getPost('tindakan'),
            'dokter' => $this->request->getPost('dokter'),
        ];
        $model->insert($data);